app/controllers/lessons_controller.rb

SELECT "lessons".* FROM "lessons"
---
  def index
    @lessons = Lesson.all

INSERT INTO "lessons" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    respond_to do |format|
      if @lesson.create(lesson_params)

UPDATE "lessons" SET "matiere_id" = $1, "updated_at" = $2 WHERE "lessons"."id" = $3  [["matiere_id", 1], ["updated_at", "2018-06-07 14:25:01.382222"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @lesson.update(lesson_params)

SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_lesson
      @lesson = Lesson.find(params[:id])