app/controllers/matieres_controller.rb

SELECT "matieres".* FROM "matieres"
---
  def index
    @matieres = Matiere.all

SELECT "lessons".* FROM "lessons" WHERE "lessons"."matiere_id" = $1  [["matiere_id", 1]]
---
  def show
    @lessons = Lesson.where(matiere_id: @matiere)

INSERT INTO "matieres" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Ecritures Médias Numériques "], ["created_at", "2018-06-06 15:41:10.877274"], ["updated_at", "2018-06-06 15:41:10.877274"]]
---
  def create
    @matiere = Matiere.new(matiere_params)
    @matiere.save

SELECT  "matieres".* FROM "matieres" WHERE "matieres"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_matiere
      @matiere = Matiere.find(params[:id])